Конфигурация/DataProcessors/ПечатьИВыгрузкаДокументовПоНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьИВыгрузкаДокументовПоНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НачислениеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.ВводДенежныхСредств</xr:Item>
				<xr:Item>Document.РасчетНДФЛ</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеДоходыИРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКлиентскомуОтноситьНаДатуОплаты</Name>
					<Comment>По клиентскому учету относить на дату оплаты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогИлиВзнос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиИВзносы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачестьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПоОбщимРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предварительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Арендатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураСводный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактура</Name>
			<BasedOn>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыПолученного</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьИВыгрузкаДокументовПоНедвижимости/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ЕдиницыИзмерения = Документы.НачислениеЗадолженности.ПолучитьСписокЕдиницИзмерения();
	
	МакетСчетаФактуры = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьМакет("СчетФактура");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Ссылка", Объект.Документ);
	ПараметрыПечати.Вставить("Организация", Объект.Организация);
	ПараметрыПечати.Вставить("Директор", Объект.Директор);
	ПараметрыПечати.Вставить("ГлавныйБухгалтер", Объект.ГлавныйБухгалтер);
	
	РезультатЗапроса = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьДанныеПечатиСчетаФактуры(Запрос, ПараметрыПечати);
	
	ВыборкаШапка = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ШапкаСчетаФактуры").Выбрать();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// С 01.10.2024 требуется новый формат счёт-фактур в бумажном виде
	Если ЗначениеЗаполнено(Объект.Документ) И Объект.Документ.Дата >= Дата(2024, 10, 1) Тогда
		ИмяОбластиШапкаСчетаФактуры = "ШапкаС20241001";
	Иначе
		ИмяОбластиШапкаСчетаФактуры = "Шапка";
	КонецЕсли;
	
	ШапкаСчетаФактуры = МакетСчетаФактуры.ПолучитьОбласть(ИмяОбластиШапкаСчетаФактуры);
	ШапкаТаблицыСчетаФактуры = МакетСчетаФактуры.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОснованияСчетаФактуры = МакетСчетаФактуры.ПолучитьОбласть("Основания");
	ПодвалСчетаФактуры = МакетСчетаФактуры.ПолучитьОбласть("Подвал");
	
	ТабличныйДокументСчетФактура.Очистить();
	ТабличныйДокументСчетФактура.АвтоМасштаб = Истина;
	
	ТабличныйДокументАкт.Очистить();
	ТабличныйДокументАкт.АвтоМасштаб = Истина;
	
	ТабличныйДокументСчет.Очистить();
	ТабличныйДокументСчет.АвтоМасштаб = Истина;
	
	ВставлятьРазделительСтраниц 			= Ложь;
	ВставлятьРазделительСтраницАктаИСчета 	= Ложь;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ВыборкаШапка.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ №"
				+ ВыборкаШапка.НомерСчетаФактуры + " от " + Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy")
				+ " не проведен и не будет распечатан!", ВыборкаШапка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		ЭтоАвансовыйСчФ 		= ТипЗнч(ВыборкаШапка.Ссылка) = Тип("ДокументСсылка.СчетФактура");
		ЭтоСделкаСНедвижимостью = ТипЗнч(ВыборкаШапка.Ссылка) = Тип("ДокументСсылка.АктПриемаПередачиОбъектовНедвижимости");
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокументСчетФактура.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ШапкаСчетаФактуры.Параметры.Заполнить(ВыборкаШапка);
		
		ДатаПрописью  	= Формат(ВыборкаШапка.Дата, "ДФ='dd MMMM yyyy'") + " г.";
		ПервыйПробел 	= СтрНайти(ДатаПрописью, " ");
		ШапкаСчетаФактуры.Параметры.ДатаДень 				= Лев(ДатаПрописью, ПервыйПробел - 1);
		ШапкаСчетаФактуры.Параметры.МесяцГодСчетаФактуры 	= Сред(ДатаПрописью, ПервыйПробел + 1, СтрДлина(ДатаПрописью));

		Если ПустаяСтрока(ВыборкаШапка.НомерИсправления) Тогда
			ШапкаСчетаФактуры.Параметры.НомерИсправления = "---";
			ШапкаСчетаФактуры.Параметры.ДеньИсправления = "-";
			ШапкаСчетаФактуры.Параметры.МесяцГодИсправления = "---";
		Иначе
			ДатаПрописью  	= Формат(ВыборкаШапка.ДатаИсправления, "ДФ='dd MMMM yyyy'") + " г.";
			ПервыйПробел 	= СтрНайти(ДатаПрописью, " ");
			ШапкаСчетаФактуры.Параметры.ДеньИсправления 		= Лев(ДатаПрописью, ПервыйПробел - 1);
			ШапкаСчетаФактуры.Параметры.МесяцГодИсправления 	= Сред(ДатаПрописью, ПервыйПробел + 1, СтрДлина(ДатаПрописью));
		КонецЕсли;
		
		ШапкаСчетаФактуры.Параметры.АдресПродавца 			= Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьАдресПродавцаДляСчетаФактуры(ВыборкаШапка.Организация, ВыборкаШапка.АдресПродавца);
		ШапкаСчетаФактуры.Параметры.Продавец 				= ВыборкаШапка.КраткоеНаименованиеОрганизацииПоУставу + " Д.У. " + ВыборкаШапка.КраткоеНаименованиеФонда;
		ШапкаСчетаФактуры.Параметры.ИННКПППродавца 			= ВыборкаШапка.ИННОрганизации + "/" + ВыборкаШапка.КППКрупнейшегоНалогоплательщика;
		ШапкаСчетаФактуры.Параметры.ПлатежноРасчетныеДокументы = ПолучитьПлатежныеДокументыНаСервере(Объект.Документ);
		
		ШапкаСчетаФактуры.Параметры.АвансСФ = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьАвансовыеСчФ(Объект.Документ);
		
		Если ЭтоСделкаСНедвижимостью Тогда
			ШапкаСчетаФактуры.Параметры.Грузоотправитель 	= "он же";
			ШапкаСчетаФактуры.Параметры.Грузополучатель 	= ВыборкаШапка.КраткоеНаименованиеКонтрагентаПоУставу + ", "
				+ ВыборкаШапка.ЮридическийАдресКонтрагента;
		Иначе
			ШапкаСчетаФактуры.Параметры.Грузоотправитель 	= "---";
			ШапкаСчетаФактуры.Параметры.Грузополучатель 	= "---";
		КонецЕсли;
		
		// Параметр "КоличествоСтрокВАкте" существует только для старых документов (до 01.10.2024)
		Если Не (ЗначениеЗаполнено(Объект.Документ) И Объект.Документ.Дата >= Дата(2024, 10, 1)) Тогда
			Если ЗначениеЗаполнено(ВыборкаШапка.НомерАкта) Тогда
				// Если есть акт, то выводим диапазон строк
				Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
					ШапкаСчетаФактуры.Параметры.КоличествоСтрокВАкте = "1";
				Иначе
					ШапкаСчетаФактуры.Параметры.КоличествоСтрокВАкте = "1 - " + ВыборкаДетальныеЗаписи.Количество();
				КонецЕсли;
			Иначе
				ШапкаСчетаФактуры.Параметры.КоличествоСтрокВАкте = "";
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокументСчетФактура.Вывести(ШапкаСчетаФактуры, ВыборкаШапка.Уровень());
		ТабличныйДокументСчетФактура.Вывести(ШапкаТаблицыСчетаФактуры, ВыборкаШапка.Уровень());
		
		Если ВыборкаШапка.ЭтоДоговорАренды Тогда
			Если Не ВставлятьРазделительСтраницАктаИСчета Тогда
				МакетАкта = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьМакет("Акт");
				
				ШапкаАкта 				= МакетАкта.ПолучитьОбласть("Шапка");
				ОбластьОснованияАкта 	= МакетАкта.ПолучитьОбласть("Основания");
				ПодвалАкта 				= МакетАкта.ПолучитьОбласть("Подвал");
				
				МакетСчета = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ПолучитьМакет(?(ВыборкаШапка.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо, "Счет", "СчетФизЛицо"));
				
				ШапкаСчета 				= МакетСчета.ПолучитьОбласть("Шапка");
				ОбластьОснованияСчета 	= МакетСчета.ПолучитьОбласть("Основания");
				ПодвалСчета				= МакетСчета.ПолучитьОбласть("Подвал");
				
				Если ПустаяСтрока(ВыборкаШапка.НомерИсправления) Тогда
					ШапкаАкта.УдалитьОбласть(ШапкаАкта.Области.Исправление, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ШапкаСчета.УдалитьОбласть(ШапкаСчета.Области.Исправление, ТипСмещенияТабличногоДокумента.ПоВертикали);
				КонецЕсли;

				ВставлятьРазделительСтраницАктаИСчета = Истина;
			Иначе
				ТабличныйДокументАкт.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокументСчет.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ШапкаАкта.Параметры.Заполнить(ШапкаСчетаФактуры.Параметры);
			
			ШапкаАкта.Параметры.ДатаАкта 		= Формат(ВыборкаШапка.ДатаАкта, "ДФ='dd MMMM yyyy'") + " г.";
			ШапкаАкта.Параметры.НомерДоговора 	= ВыборкаШапка.НомерДоговора;
			ШапкаАкта.Параметры.ДатаДоговора 	= Формат(ВыборкаШапка.ДатаДоговора, "ДФ=dd.MM.yyyy") + "г.";
			
			ШапкаСчета.Параметры.Заполнить(ВыборкаШапка);
			ШапкаСчета.Параметры.Заполнить(ШапкаСчетаФактуры.Параметры);
			
			ШапкаСчета.Параметры.ДатаСчета 		= Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy") + " г.";
			
			Если Не ПустаяСтрока(ВыборкаШапка.НомерИсправления) Тогда
				ШапкаАкта.Параметры.ДатаИсправления	= Формат(ВыборкаШапка.ДатаИсправления, "ДФ='dd MMMM yyyy'") + " г.";
				ШапкаСчета.Параметры.ДатаИсправления = ШапкаАкта.Параметры.ДатаИсправления;
			КонецЕсли;
			
			Если ВыборкаШапка.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
				ТЗ = РезультатЗапроса.Выгрузить();
				ШапкаСчета.Параметры.ИтогоСуммаНДС = ТЗ.Итог("СуммаНДС");
				ШапкаСчета.Параметры.ДатаПрописью = Формат(ВыборкаШапка.Дата, "ДФ='dd MMMM yyyy'") + " г.";
				ШапкаСчета.Параметры.Договор = СтрРазделить(ШапкаСчета.Параметры.Договор, ",")[1];
			КонецЕсли;

			ТабличныйДокументАкт.Вывести(ШапкаАкта, ВыборкаШапка.Уровень());
			ТабличныйДокументСчет.Вывести(ШапкаСчета, ВыборкаШапка.Уровень());
			
		КонецЕсли;
		
		СодержаниеИспользуетсяДляХраненияДанных = Документы.НачислениеЗадолженности.СодержаниеИспользуетсяДляХраненияДанных(ВыборкаШапка.ВидЗадолженностиНачисления);
		
		ИтогоСуммаНДС 			= 0;
		ИтогоСуммаСНДС 			= 0;
		ИтогоСтоимостьБезНДС 	= 0;
		СтавкаНДС				= "";
		НомерСтроки = 1;
		
		ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Цикл
			
			ОбластьОснованияСчетаФактуры.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьОснованияСчетаФактуры.Параметры.НомерСтроки = НомерСтроки;

			
			СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			ОбластьОснованияСчетаФактуры.Параметры.СтавкаНДС = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.СтавкаНалогаДляПечати(ВыборкаДетальныеЗаписи.СтавкаНДС, ЭтоАвансовыйСчФ);
			
			ЕдиницаИзмерения = ЕдиницыИзмерения.НайтиПоЗначению(Строка(ВыборкаДетальныеЗаписи.КодЕдиницыИзмерения));
			ОбластьОснованияСчетаФактуры.Параметры.ОбозначениеЕдиницыИзмерения = ?(ЕдиницаИзмерения <> Неопределено, ЕдиницаИзмерения.Представление, "-");
			Если СодержаниеИспользуетсяДляХраненияДанных Тогда
				ДополнительныеДанные = Документы.НачислениеЗадолженности.ПолучитьДополнительныеДанныеИзСодержания(ВыборкаДетальныеЗаписи.Содержание);
				Если ДополнительныеДанные <> Неопределено Тогда
					Если ВыборкаШапка.ВидЗадолженностиНачисления = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть Тогда
						КоммунальныеУслуги = Неопределено;
						ДополнительныеДанные.Свойство("КоммунальныеУслуги", КоммунальныеУслуги);
						
						КоммунальныеУслуги.Свойство("Количество", ОбластьОснованияСчетаФактуры.Параметры.Количество);
						КоммунальныеУслуги.Свойство("ЕдиницаИзмерения", ОбластьОснованияСчетаФактуры.Параметры.ОбозначениеЕдиницыИзмерения);
						КоммунальныеУслуги.Свойство("ЕдиницаИзмеренияКод", ОбластьОснованияСчетаФактуры.Параметры.КодЕдиницыИзмерения);
						КоммунальныеУслуги.Свойство("Описание", ОбластьОснованияСчетаФактуры.Параметры.Содержание);				
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ЭтоСделкаСНедвижимостью Тогда
				ОбластьОснованияСчетаФактуры.Параметры.Содержание = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.СодержаниеДляСделкиСНедвижимостью(ВыборкаШапка, ВыборкаДетальныеЗаписи);
			КонецЕсли;

			ОбластьОснованияСчетаФактуры.Параметры.Тариф = ?(ОбластьОснованияСчетаФактуры.Параметры.Количество <> 0,
				ОбластьОснованияСчетаФактуры.Параметры.СтоимостьБезНДС / ОбластьОснованияСчетаФактуры.Параметры.Количество, 0);
			ТабличныйДокументСчетФактура.Вывести(ОбластьОснованияСчетаФактуры, ВыборкаДетальныеЗаписи.Уровень());
			
			Если ВыборкаШапка.ЭтоДоговорАренды Тогда
				
				ОбластьОснованияАкта.Параметры.Заполнить(ОбластьОснованияСчетаФактуры.Параметры);
					ОбластьОснованияАкта.Параметры.ЦенаСНДС = ?(ОбластьОснованияАкта.Параметры.Количество <> 0,
						ОбластьОснованияАкта.Параметры.СуммаСНДС / ОбластьОснованияАкта.Параметры.Количество, 0);
				ТабличныйДокументАкт.Вывести(ОбластьОснованияАкта, ВыборкаДетальныеЗаписи.Уровень());
				
				ОбластьОснованияСчета.Параметры.Заполнить(ОбластьОснованияСчетаФактуры.Параметры);
				
				Если ВыборкаШапка.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
					ОбластьОснованияСчета.Параметры.ЦенаСНДС = ?(ОбластьОснованияСчета.Параметры.Количество <> 0,
						ОбластьОснованияСчета.Параметры.СуммаСНДС / ОбластьОснованияСчета.Параметры.Количество, 0);
				Иначе
					Если ОбластьОснованияСчета.Параметры.СуммаНДС = 0 Тогда
						ОбластьОснованияСчета.Параметры.СуммаНДС = "Без НДС";
					КонецЕсли;
				КонецЕсли;
				
				ТабличныйДокументСчет.Вывести(ОбластьОснованияСчета, ВыборкаДетальныеЗаписи.Уровень());
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			ИтогоСуммаНДС = ИтогоСуммаНДС + ВыборкаДетальныеЗаписи.СуммаНДС;
			ИтогоСуммаСНДС = ИтогоСуммаСНДС + ВыборкаДетальныеЗаписи.СуммаСНДС;
			ИтогоСтоимостьБезНДС = ИтогоСтоимостьБезНДС + ВыборкаДетальныеЗаписи.СтоимостьБезНДС;
			
		КонецЦикла;
		
		ПодвалСчетаФактуры.Параметры.Заполнить(ВыборкаШапка);
		ПодвалСчетаФактуры.Параметры.ИтогоСуммаНДС  		= ИтогоСуммаНДС;
		ПодвалСчетаФактуры.Параметры.ИтогоСуммаСНДС  		= ИтогоСуммаСНДС;
		ПодвалСчетаФактуры.Параметры.ИтогоСтоимостьБезНДС 	= ИтогоСтоимостьБезНДС;
		
		ТабличныйДокументСчетФактура.Вывести(ПодвалСчетаФактуры);
		
		Если ВыборкаШапка.ЭтоДоговорАренды Тогда
			
			ПодвалАкта.Параметры.Заполнить(ПодвалСчетаФактуры.Параметры);
			ПодвалАкта.Параметры.СтавкаНДС = СтавкаНДС;
			ПодвалАкта.Параметры.КоличествоУслуг = ВыборкаДетальныеЗаписи.Количество();
			ПодвалАкта.Параметры.ИтогоСуммаСНДСПрописью = СуммаВРубляхПрописью(ИтогоСуммаСНДС); 
			ПодвалАкта.Параметры.ДолжностьДиректора = ВыборкаШапка.ДолжностьГенДира;
			ПодвалАкта.Параметры.ФИОДиректора = ВыборкаШапка.ГенДир;
			
			ТабличныйДокументАкт.Вывести(ПодвалАкта);
			
			ПодвалСчета.Параметры.Заполнить(ПодвалСчетаФактуры.Параметры);
			
			ПодвалСчета.Параметры.ИтогоСуммаСНДСПрописью = СуммаВРубляхПрописью(ИтогоСуммаСНДС);
			ПодвалСчета.Параметры.ДолжностьДиректора = ВыборкаШапка.ДолжностьГенДира;
			ПодвалСчета.Параметры.ФИОДиректора = ВыборкаШапка.ГенДир;
			
			Если ВыборкаШапка.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
				ПодвалСчета.Параметры.СтавкаНДС = СтавкаНДС;
				ПодвалСчета.Параметры.КоличествоУслуг = ВыборкаДетальныеЗаписи.Количество();
				ПодвалСчета.Параметры.ФИОГлавБуха = ВыборкаШапка.ГлавБух;
			Иначе
				ПодвалСчета.Параметры.ИтогоСуммаСНДСПрописью = СуммаВРубляхПрописьюБезЧисел(ИтогоСуммаСНДС);
				ПодвалСчета.Параметры.ИтогоСуммаНДСПрописью = СуммаВРубляхПрописьюБезЧисел(ИтогоСуммаНДС);
			КонецЕсли;
			
			ТабличныйДокументСчет.Вывести(ПодвалСчета);
			
		КонецЕсли;
			
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	
	Если Параметры.Свойство("Документ") Тогда
		Объект.Документ = Параметры.Документ;
	КонецЕсли;
	
	ТабличныйДокументСчетФактура.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПлатежныеДокументыНаСервере(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактура") Тогда
		
		Возврат Документы.СчетФактура.ПолучитьПлатежныеДокументы(Ссылка);
		
	Иначе
		
		Результат = "";
		
		РезультатЗапроса = Обработки.ПечатьИВыгрузкаДокументовПоНедвижимости.ВыбратьПлатежныеДокументы(Ссылка);
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Результат <> "" Тогда
				Результат = Результат + ", ";
			КонецЕсли;
			
			Результат = Результат + ВыборкаДетальныеЗаписи.НомерПлатежногоДокумента + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy")
			
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммаВРубляхПрописью(Сумма)
	
	Возврат Строка(Цел(Сумма))
		+ " (" + ЧислоПрописью(Цел(Сумма), "НП=ЛОЖЬ;НД=ЛОЖЬ", ",,,,,,,,0") + ") " 
		+ РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(Цел(Сумма), "рубль ", "рубля ", "рублей ")
		+ СтрЗаменить(ЧислоПрописью(Сумма - Цел(Сумма), "НП=ЛОЖЬ", ",,,,копейка,копейки,копеек,ж,2"), "Ноль ", "");
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммаВРубляхПрописьюБезЧисел(Сумма)
	
	Возврат ЧислоПрописью(Цел(Сумма), "НП=ЛОЖЬ;НД=ЛОЖЬ", ",,,,,,,,0") + " "
		+ РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(Цел(Сумма), "рубль ", "рубля ", "рублей ")
		+ СтрЗаменить(ЧислоПрописью(Сумма - Цел(Сумма), "НП=ЛОЖЬ", ",,,,копейка,копейки,копеек,ж,2"), "Ноль ", "");
	
КонецФункции
